README.md

# Table of Contents

-   [Introduction](#orgb08ad2a)
-   [Specification](#org3655a3d)
    -   [Definitions](#org9655396)
        -   [Promise](#orge1591ce)
        -   [Agent](#orgde662ed)
        -   [Goal](#org0c02c63)
        -   [Decision](#orge6df6e6)
    -   [Architecture](#org1b6ee1b)
        -   [Layers](#org4f5020b)
        -   [Networks](#orgb5f9d78)
-   [Setup](#org28f1bc5)
    -   [Full Node](#orgb05c078)
        -   [Step 1: set up commons layer](#orge79d89c)
        -   [Step 2: set up governance layer](#org83eb802)
        -   [Step 3: set up `unrival-cli`](#org9ce5300)
    -   [Client](#org92724bd)
        -   [Step 1: download](#orgf801ec8)
        -   [Step 2: install](#org8b2f971)
        -   [Step 3: connect to root](#orgcd516b3)
        -   [Step 4: configure interpretation](#org4e3960b)
-   [User Stories](#org811738c)
    -   [Create an Open Source TOE](#orge553a10)



<a id="orgb08ad2a"></a>

# Introduction

Unrival is a protocol for directing collective intelligence towards the accomplishing of arbitrary goals.


<a id="org3655a3d"></a>

# Specification

This is a brief description of the Unrival Specification.  The full spec can be found in the whitepaper.


<a id="org9655396"></a>

## Definitions


<a id="orge1591ce"></a>

### Promise


<a id="orgde662ed"></a>

### Agent


<a id="org0c02c63"></a>

### Goal

A *goal* is simply desirable outcomes that can be subscribed to by one or more agents.  Strictly speaking, goals are not a necessary part of the protocol.          


<a id="orge6df6e6"></a>

### Decision

A *decision* is a proposal to change the state of an agent.

-   Consensus

-   Democratic

-   Meritocratic


<a id="org1b6ee1b"></a>

## Architecture


<a id="org4f5020b"></a>

### Layers

-   Commons

-   Governance

-   Interpretation


<a id="orgb5f9d78"></a>

### Networks

-   Root

-   Graph

-   Merging


<a id="org28f1bc5"></a>

# Setup


<a id="orgb05c078"></a>

## Full Node


<a id="orge79d89c"></a>

### Step 1: set up commons layer

-   IPFS

-   Dat


<a id="org83eb802"></a>

### Step 2: set up governance layer

-   Ethereum

-   Holochain

-   Credit Commons Protocol


<a id="org9ce5300"></a>

### Step 3: set up `unrival-cli`


<a id="org92724bd"></a>

## Client


<a id="orgf801ec8"></a>

### Step 1: download


<a id="org8b2f971"></a>

### Step 2: install


<a id="orgcd516b3"></a>

### Step 3: connect to root


<a id="org4e3960b"></a>

### Step 4: configure interpretation


<a id="org811738c"></a>

# User Stories


<a id="orge553a10"></a>

## Create an Open Source TOE

